Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/rtc.h
/*
 * Component description for RTC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-10T14:22:36Z */
#ifndef _PIC32CXMTC_RTC_COMPONENT_H_
#define _PIC32CXMTC_RTC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR RTC                                          */
/* ************************************************************************** */

/* -------- RTC_FSTR : (RTC Offset: 0x00) ( R/ 32) First Stamping Time Register of Source 0 -------- */
#define RTC_FSTR_SEC_Pos                      _UINT32_(0)                                          /* (RTC_FSTR) Seconds of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSTR_SEC_Msk                      (_UINT32_(0x7F) << RTC_FSTR_SEC_Pos)                 /* (RTC_FSTR) Seconds of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSTR_SEC(value)                   (RTC_FSTR_SEC_Msk & (_UINT32_(value) << RTC_FSTR_SEC_Pos)) /* Assigment of value for SEC in the RTC_FSTR register */
#define RTC_FSTR_MIN_Pos                      _UINT32_(8)                                          /* (RTC_FSTR) Minutes of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSTR_MIN_Msk                      (_UINT32_(0x7F) << RTC_FSTR_MIN_Pos)                 /* (RTC_FSTR) Minutes of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSTR_MIN(value)                   (RTC_FSTR_MIN_Msk & (_UINT32_(value) << RTC_FSTR_MIN_Pos)) /* Assigment of value for MIN in the RTC_FSTR register */
#define RTC_FSTR_HOUR_Pos                     _UINT32_(16)                                         /* (RTC_FSTR) Hours of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSTR_HOUR_Msk                     (_UINT32_(0x3F) << RTC_FSTR_HOUR_Pos)                /* (RTC_FSTR) Hours of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSTR_HOUR(value)                  (RTC_FSTR_HOUR_Msk & (_UINT32_(value) << RTC_FSTR_HOUR_Pos)) /* Assigment of value for HOUR in the RTC_FSTR register */
#define RTC_FSTR_AMPM_Pos                     _UINT32_(22)                                         /* (RTC_FSTR) AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSTR_AMPM_Msk                     (_UINT32_(0x1) << RTC_FSTR_AMPM_Pos)                 /* (RTC_FSTR) AM/PM Indicator of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSTR_AMPM(value)                  (RTC_FSTR_AMPM_Msk & (_UINT32_(value) << RTC_FSTR_AMPM_Pos)) /* Assigment of value for AMPM in the RTC_FSTR register */
#define RTC_FSTR_TEVCNT_Pos                   _UINT32_(24)                                         /* (RTC_FSTR) Tamper Events Counter (cleared by reading RTC_LSDRx) Position */
#define RTC_FSTR_TEVCNT_Msk                   (_UINT32_(0xF) << RTC_FSTR_TEVCNT_Pos)               /* (RTC_FSTR) Tamper Events Counter (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSTR_TEVCNT(value)                (RTC_FSTR_TEVCNT_Msk & (_UINT32_(value) << RTC_FSTR_TEVCNT_Pos)) /* Assigment of value for TEVCNT in the RTC_FSTR register */
#define RTC_FSTR_BACKUP_Pos                   _UINT32_(31)                                         /* (RTC_FSTR) System Mode of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSTR_BACKUP_Msk                   (_UINT32_(0x1) << RTC_FSTR_BACKUP_Pos)               /* (RTC_FSTR) System Mode of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSTR_BACKUP(value)                (RTC_FSTR_BACKUP_Msk & (_UINT32_(value) << RTC_FSTR_BACKUP_Pos)) /* Assigment of value for BACKUP in the RTC_FSTR register */
#define RTC_FSTR_Msk                          _UINT32_(0x8F7F7F7F)                                 /* (RTC_FSTR) Register Mask  */

/* UTC mode */
#define RTC_FSTR_UTC_Msk                      _UINT32_(0x00000000)                                  /* (RTC_FSTR_UTC) Register Mask  */


/* -------- RTC_FSDR : (RTC Offset: 0x04) ( R/ 32) First Stamping Date Register of Source 0 -------- */
#define RTC_FSDR_CENT_Pos                     _UINT32_(0)                                          /* (RTC_FSDR) Century of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSDR_CENT_Msk                     (_UINT32_(0x7F) << RTC_FSDR_CENT_Pos)                /* (RTC_FSDR) Century of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSDR_CENT(value)                  (RTC_FSDR_CENT_Msk & (_UINT32_(value) << RTC_FSDR_CENT_Pos)) /* Assigment of value for CENT in the RTC_FSDR register */
#define RTC_FSDR_YEAR_Pos                     _UINT32_(8)                                          /* (RTC_FSDR) Year of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSDR_YEAR_Msk                     (_UINT32_(0x7F) << RTC_FSDR_YEAR_Pos)                /* (RTC_FSDR) Year of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSDR_YEAR(value)                  (RTC_FSDR_YEAR_Msk & (_UINT32_(value) << RTC_FSDR_YEAR_Pos)) /* Assigment of value for YEAR in the RTC_FSDR register */
#define RTC_FSDR_MONTH_Pos                    _UINT32_(16)                                         /* (RTC_FSDR) Month of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSDR_MONTH_Msk                    (_UINT32_(0x1F) << RTC_FSDR_MONTH_Pos)               /* (RTC_FSDR) Month of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSDR_MONTH(value)                 (RTC_FSDR_MONTH_Msk & (_UINT32_(value) << RTC_FSDR_MONTH_Pos)) /* Assigment of value for MONTH in the RTC_FSDR register */
#define RTC_FSDR_DAY_Pos                      _UINT32_(21)                                         /* (RTC_FSDR) Day of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSDR_DAY_Msk                      (_UINT32_(0x7) << RTC_FSDR_DAY_Pos)                  /* (RTC_FSDR) Day of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSDR_DAY(value)                   (RTC_FSDR_DAY_Msk & (_UINT32_(value) << RTC_FSDR_DAY_Pos)) /* Assigment of value for DAY in the RTC_FSDR register */
#define RTC_FSDR_DATE_Pos                     _UINT32_(24)                                         /* (RTC_FSDR) Date of the Tamper (cleared by reading RTC_LSDRx) Position */
#define RTC_FSDR_DATE_Msk                     (_UINT32_(0x3F) << RTC_FSDR_DATE_Pos)                /* (RTC_FSDR) Date of the Tamper (cleared by reading RTC_LSDRx) Mask */
#define RTC_FSDR_DATE(value)                  (RTC_FSDR_DATE_Msk & (_UINT32_(value) << RTC_FSDR_DATE_Pos)) /* Assigment of value for DATE in the RTC_FSDR register */
#define RTC_FSDR_Msk                          _UINT32_(0x3FFF7F7F)                                 /* (RTC_FSDR) Register Mask  */

/* UTC mode */
#define RTC_FSDR_UTC_Msk                      _UINT32_(0x00000000)                                  /* (RTC_FSDR_UTC) Register Mask  */


