Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/rtc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief RTC_SUB0 register API structure */
typedef struct
{
  __I   uint32_t                       RTC_FSTR;           /**< Offset: 0x00 (R/   32) First Stamping Time Register of Source 0 */
  __I   uint32_t                       RTC_FSDR;           /**< Offset: 0x04 (R/   32) First Stamping Date Register of Source 0 */
  __I   uint32_t                       RTC_LSTR;           /**< Offset: 0x08 (R/   32) Last Stamping Time Register of Source 0 */
  __I   uint32_t                       RTC_LSDR;           /**< Offset: 0x0C (R/   32) Last Stamping Date Register of Source 0 */
} rtc_sub0_registers_t;

#define RTC_SUB0_NUMBER 5

/** \brief RTC register API structure */
typedef struct
{
  __IO  uint32_t                       RTC_CR;             /**< Offset: 0x00 (R/W  32) Control Register */
  __IO  uint32_t                       RTC_MR;             /**< Offset: 0x04 (R/W  32) Mode Register */
  __IO  uint32_t                       RTC_TIMR;           /**< Offset: 0x08 (R/W  32) Time Register */
  __IO  uint32_t                       RTC_CALR;           /**< Offset: 0x0C (R/W  32) Calendar Register */
  __IO  uint32_t                       RTC_TIMALR;         /**< Offset: 0x10 (R/W  32) Time Alarm Register */
  __IO  uint32_t                       RTC_CALALR;         /**< Offset: 0x14 (R/W  32) Calendar Alarm Register */
  __I   uint32_t                       RTC_SR;             /**< Offset: 0x18 (R/   32) Status Register */
  __O   uint32_t                       RTC_SCCR;           /**< Offset: 0x1C ( /W  32) Status Clear Command Register */
  __O   uint32_t                       RTC_IER;            /**< Offset: 0x20 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       RTC_IDR;            /**< Offset: 0x24 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       RTC_IMR;            /**< Offset: 0x28 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       RTC_VER;            /**< Offset: 0x2C (R/   32) Valid Entry Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       RTC_TCR;            /**< Offset: 0x34 (R/W  32) Tamper Control Register */
  __I   uint32_t                       RTC_TISR;           /**< Offset: 0x38 (R/   32) Tamper Input Status Register */
  __I   uint8_t                        Reserved2[0x04];
        rtc_sub0_registers_t           RTC_SUB0[RTC_SUB0_NUMBER]; /**< Offset: 0x40  */
} rtc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTC_RTC_COMPONENT_H_ */
